Repository: iziadehap/RetireSmart
Catalog: lib/l10n/intl_*.arb
Languages: ar

# appTitle
source: RetireSmart AI
ar: المستشار الذكي للتقاعد

# step1Title
source: Let's start with the basics.
ar: لنبدأ بالأساسيات.

# currentAgeLabel
source: Current Age
ar: العمر الحالي

# targetRetirementAgeLabel
source: Target Retirement Age
ar: سن التقاعد المستهدف

# incomeExpensesTitle
source: Income & Expenses
ar: الدخل والمصاريف

# gapDescription
source: We use this to calculate your gap.
ar: نستخدم هذه المعلومات لحساب الفجوة المالية.

# monthlyIncomeLabel
source: Monthly Income
ar: الدخل الشهري

# additionalIncomeLabel
source: Additional Income (Optional)
ar: دخل إضافي (اختياري)

# monthlyExpensesLabel
source: Monthly Expenses
ar: المصاريف الشهرية

# assetsStrategyTitle
source: Assets & Strategy
ar: الأصول والإستراتيجية

# currentSavingsLabel
source: Current Savings
ar: المدخرات الحالية

# riskAppetiteLabel
source: RISK APPETITE
ar: قابلية المخاطرة

# backButton
source: Back
ar: رجوع

# nextButton
source: Next
ar: التالي

# calculateButton
source: Calculate
ar: احسب

# generatePlanButton
source: GENERATE PLAN
ar: إنشاء الخطة

# continueButton
source: CONTINUE
ar: متابعة

# analyzingLabel
source: ANALYZING FINANCIAL FUTURE
ar: جاري تحليل مستقبلك المالي

# pleaseWaitLabel
source: Please wait moment...
ar: يرجى الانتظار لحظة...

# blueprintTitle
source: YOUR BLUEPRINT
ar: مخططك المالي

# monthlyTargetLabel
source: MONTHLY TARGET
ar: الهدف الشهري

# requiredSavingsLabel
source: REQUIRED SAVINGS
ar: المدخرات المطلوبة

# exceedsIncomeLabel
source: Exceeds Available Income
ar: يتجاوز الدخل المتاح

# withinBudgetLabel
source: Within Budget
ar: ضمن الميزانية

# nestEggLabel
source: NEST EGG
ar: رأس المال المطلوب

# timelineLabel
source: TIMELINE
ar: الجدول الزمني

# assetAllocationLabel
source: ASSET ALLOCATION
ar: توزيع الأصول

# createNewPlanButton
source: CREATE NEW PLAN
ar: إنشاء خطة جديدة

# disclaimerText
source: AI PROJECTION • ESTIMATES BASED ON CURRENT METRICS
ar: توقعات الذكاء الاصطناعي • تقديرات بناءً على المعطيات الحالية

# riskHigh
source: High
ar: مخاطرة عالية

# riskMedium
source: Medium
ar: مخاطرة متوسطة

# riskLow
source: Low
ar: مخاطرة منخفضة

# riskHighDesc
source: Aggressive Growth • High Volatility
ar: نمو قوي • تقلبات عالية

# riskMediumDesc
source: Balanced • Moderate Growth
ar: متوازن • نمو معتدل

# riskLowDesc
source: Conservative • Capital Preservation
ar: محافظ • الحفاظ على رأس المال

# errorValidAges
source: Please enter valid ages.
ar: يرجى إدخال أعمار صحيحة.

# errorNegativeAges
source: Ages cannot be negative.
ar: لا يمكن أن تكون الأعمار سلبية.

# errorAgeLogic
source: Current age must be less than retirement age.
ar: يجب أن يكون العمر الحالي أقل من سن التقاعد.

# errorValidAmounts
source: Please enter valid amounts.
ar: يرجى إدخال مبالغ صحيحة.

# errorNegativeAmounts
source: Amounts cannot be negative.
ar: لا يمكن للمبالغ أن تكون سلبية.

# errorValidSavings
source: Please enter valid savings amount.
ar: يرجى إدخال مبلغ ادخار صحيح.

# errorNegativeSavings
source: Savings cannot be negative.
ar: لا يمكن للمدخرات أن تكون سلبية.

# errorGeneric
source: Error
ar: خطأ

source: Gold Prices
ar: سعر الذهب

source: Failed to load gold data.
ar: فشل في تحميل بيانات الذهب.

# karatPrices
source: KARAT PRICES (PER GRAM)
ar: أسعار القيراط (للغرام الواحد)

source: Currency
ar: العملة

source: Unit
ar: الوحدة

source: Source
ar: المصدر

source: Last Updated
ar: آخر تحديث

source: Buy Price
ar: سعر الشراء

source: Sell Price
ar: سعر البيع

source: Buy
ar: شراء

source: Sell
ar: بيع

source: Welcome back,
ar: مرحبا بعودتك

source: Gold Investment
ar: الاستثمار في الذهب

source: Retirement Planning
ar: التخطيط للتقاعد

# retirementPlanningDesc
source: Plan your golden years with confidence
ar: خطط لسنواتك الذهبية بثقة

# goldInvestmentDesc
source: Track live market rates & manage portfolio
ar: تتبع أسعار السوق الحية وإدارة محفظتك

source: Settings
ar: الإعدادات

source: Recalculate?
ar: إعادة الحساب؟

# resetConfirmation
source: Are you sure you want to start over? Current results will be lost.
ar: هل أنت متأكد من رغبتك في البدء من جديد؟ سيتم فقدان النتائج الحالية.

source: Yes, Reset
ar: نعم، إعادة تعيين

source: No, Cancel
ar: لا، إلغاء

# inflationProjectionLabel
source: Inflation Projection
ar: توقعات التضخم

source: Connection Lost
ar: فقد الاتصال

# couldntReachTheGoldServers
source: We couldn't reach the gold servers. Please check your internet connection.
ar: لا يمكن الوصول إلى خادم الذهب. يرجى التحقق من اتصالك بالإنترنت.

source: Server Error
ar: خطأ في الخادم

# problemWithTheRequest
source: There was a problem with the request. Please try again later.
ar: هناك مشكلة في طلبك. يرجى المحاولة مرة أخرى.

source: Storage Error
ar: خطأ في التخزين

# failedToLoadCachedData
source: Failed to load cached data. Please try refreshing.
ar: فشل في تحميل البيانات المخزنة. يرجى المحاولة مرة أخرى.

source: BACK ONLINE
ar: تم الاتصال بالإنترنت

source: TRY AGAIN
ar: حاول مرة أخرى

source: Last Seen
ar: آخر سعر

# offline
source: You are offline. Showing cached data.
ar: غير متصل بالإنترنت

# sharePlanMessage
source: Here is my retirement plan from RetireSmart AI!
ar: إليك خطتي التقاعدية من تطبيق المستشار الذكي للتقاعد!

# sharePlanSubject
source: My Retirement Plan
ar: خطتي التقاعدية

# investmentGuideTitle
source: Investment Guide
ar: دليل الاستثمار

# thndrGuideTitle
source: Investment Guide via Thndr
ar: دليل الاستثمار عبر Thndr

# thndrRecommendation
source: Thndr is the recommended app for investing in Egypt – easy and secure
ar: Thndr هو التطبيق الموصى به للاستثمار في مصر – سهل وآمن

# goldSectionTitle
source: Gold
ar: الذهب (Gold)

# goldSectionDesc
source: To invest in gold, buy into a gold fund like 'Thndr Gold Fund' – it tracks the global gold price.
ar: للاستثمار في الذهب، اشترِ في صندوق الذهب مثل 'Thndr Gold Fund' – يتابع سعر الذهب العالمي.

# stocksSectionTitle
source: Stocks
ar: الأسهم (Stocks)

# stocksSectionDesc
source: For stocks, buy into an equity fund like 'Thndr Egypt Stock Fund' – it invests in Egyptian Stock Exchange shares. Expected annual return 10-15% depending on the market.
ar: للأسهم، اشترِ في صندوق أسهم مثل 'Thndr Egypt Stock Fund' – يستثمر في أسهم البورصة المصرية. عائد متوقع 10-15% سنويًا حسب السوق

# certificatesSectionTitle
source: Certificates
ar: الشهادات (Certificates)

# certificatesSectionDesc
source: For certificates, choose bank certificates like 'Thndr Bank Certificates' – fixed return up to 20%, safe and guaranteed.
ar: للشهادات، اختر شهادات بنوك مثل 'Thndr Bank Certificates' – عائد ثابت يصل 20%، آمنة ومضمونة

source: Download Thndr
ar: تحميل Thndr

# referralMessage
source: Use my referral link to sign up: https://thndr.app.link/iziadehap and you'll get a reward, and I'll get a commission after your first deposit.
ar: استخدم رابطي للتسجيل: https://thndr.app.link/iziadehap وستحصل على مكافأة، وأنا هأخذ عمولة بعد إيداعك الأول

# riskQuizPrompt
source: Don't know your risk? Try this quiz
ar: مش عارف مستوى مخاطرتك؟ جرب الاختبار ده

# riskQuizTitle
source: Risk Assessment
ar: تقييم المخاطر

# riskQuizQuestion1
source: When do you plan to start withdrawing your retirement savings?
ar: إمتى ناوي تبدأ تسحب من مدخراتك للتقاعد؟

# riskQuizQ1Option1
source: In less than 5 years
ar: في أقل من 5 سنين

# riskQuizQ1Option2
source: In 5 to 15 years
ar: خلال 5 لـ 15 سنة

# riskQuizQ1Option3
source: In more than 15 years
ar: بعد أكتر من 15 سنة

# riskQuizQuestion2
source: If your investments dropped 20% in value overnight, what would you do?
ar: لو استثماراتك قلت قيمتها 20% فجأة في يوم وليلة، هتعمل إيه؟

# riskQuizQ2Option1
source: Sell everything immediately to protect my remaining money
ar: هبيع كل حاجة فوراً عشان أحمي اللي فاضل

# riskQuizQ2Option2
source: Wait and see if it recovers, but avoid adding more
ar: هستنى وأشوف لو هتتحسن، بس مش هزود استثماري

# riskQuizQ2Option3
source: Stay calm or even invest more while prices are low
ar: هفضل هادي أو حتى هزود استثماري بما إن الأسعار رخيصة

# riskQuizQuestion3
source: What is your primary financial goal for this plan?
ar: إيه هو هدفك المالي الأساسي من الخطة دي؟

# riskQuizQ3Option1
source: Protecting my initial savings at all costs
ar: حماية أصل فلوسي بأي تمن

# riskQuizQ3Option2
source: A balanced growth while keeping risk moderate
ar: نمو متوازن مع الحفاظ على مستوى مخاطرة متوسط

# riskQuizQ3Option3
source: Maximizing long-term growth even with high volatility
ar: أقصى نمو ممكن على المدى الطويل حتى لو فيه تقلبات عالية

# riskQuizQuestion4
source: How would you describe your investment experience?
ar: تقدر توصف خبرتك في الاستثمار بإيه؟

# riskQuizQ4Option1
source: Beginner - I am new to investing
ar: مبتدئ - أنا لسه جديد في موضوع الاستثمار

# riskQuizQ4Option2
source: Intermediate - I understand stocks and bonds
ar: متوسط - فاهم في الأسهم والسندات شوية

# riskQuizQ4Option3
source: Advanced - I follow the markets and manage my portfolio
ar: متقدم - بتابع السوق وبدير محفظتي بنفسي

# riskQuizResultLow
source: Your results suggest a CONSERVATIVE risk profile.
ar: نتايجك بتقول إن مستوى مخاطرتك (محافظ/منخفض).

# riskQuizResultMedium
source: Your results suggest a BALANCED risk profile.
ar: نتايجك بتقول إن مستوى مخاطرتك (متوازن/متوسط).

# riskQuizResultHigh
source: Your results suggest an AGGRESSIVE risk profile.
ar: نتايجك بتقول إن مستوى مخاطرتك (جريء/عالي).

# setRiskLevelButton
source: SET RISK LEVEL
ar: تعيين مستوى المخاطرة

# onboardingTitle1
source: Plan Your Future
ar: خطط لمستقبلك

# onboardingDesc1
source: Take control of your retirement with AI-powered financial projections.
ar: تحكم في تقاعدك مع توقعات مالية مدعومة بالذكاء الاصطناعي.

# onboardingTitle2
source: Track Gold Prices
ar: تتبع أسعار الذهب

# onboardingDesc2
source: Stay updated with live gold market rates and investment opportunities.
ar: ابق على اطلاع بأسعار الذهب الحية وفرص الاستثمار المتاحة.

# onboardingTitle3
source: Localized Experience
ar: تجربة محلية بالكامل

# onboardingDesc3
source: Access all features in both Arabic and English tailored for your needs.
ar: جميع الخصائص متاحة باللغتين العربية والإنجليزية لتناسب احتياجاتك.

source: Get Started
ar: ابدأ الآن

source: Skip
ar: تخطي
